# 项目流程

### 售前咨询 [STG 0-1]

回答客户咨询问题

### 项目沟通 [STG 0-2]

同客户确定项目的背景，要解决的问题和实现的目标，项目的功能范围，软件产品的使用场景，客户规模。
同时了解客户发票信息，并提供报价。

> 产出：项目目标，需求范围说明，项目合同

* * *

### 整理需求 [STG 1]

> 输入：项目合同-附录A(需求范围及主要功能说明)，项目定金

基于沟通的功能范围进行项目的需求整理，将项目范围进行细化，完成详细的任务细则内容。并整理项目的领域关键词。同时收集索取的服务器信息，账号信息。

任务需求包含: `任务说明`, `任务优先级`, `任务负责人`

> 产出：项目背景说明，Github Porjects任务，项目开始会议，服务器信息，账号信息，证书信息

### 设计 [STG 2-1]

> 输入：项目背景说明，项目目标，Github Porjects任务

根据项目的详细任务需求进行相关设计，设计在内容需满足接下来Sprint开发中涉及的内容。

2.  UI/UX 设计
3.  前端架构设计方案及说明
4.  系统架构设计方案及说明
5.  数据结构设计方案及说明
6.  API接口设计方案及说明

> 产出：UI设计稿，前端架构图，后端架构图，数据结构文档，API文档*

### Sprint开发[STG 2-2] x N

> 输入：项目背景说明，项目目标，Github Porjects任务，UI设计稿，前端架构图，后端架构图，数据结构文档，API文档，scrum阶段会议

2.  通过scrum阶段会议选择下一阶段所需要完成的任务
3.  开发，测试，自动集成
4.  每日进行scrum会议，记录阶段完成的内容和blocker

> 产出：可运行的代码, dev 和 stag版本

### 部署[STG 2-3]

> 输入：代码，服务器信息，账号信息

将代码部署到客户的相关服务器上。

> 输出: 可运行的代码的生产版本，部署说明文档

* * *

### 交接[STG 3] Oliver

> 输入：尾款

部署架构说明文档

> 输出：部署架构说明文档

### 维护[STG 4] Bain

> 输入：BUG任务

保持代码正常运行，在运行期间的bug，需要创建bug任务来说明并复现bug
